project-root/app/Models/BooksModel.php

SELECT *
FROM `books`
SELECT *
FROM `books`
WHERE `slug` = 'malioboro'
 LIMIT 1
---
    public function getBooks($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();