project-root/app/Controllers/Books.php

    public function delete($id) {
        $this-> booksModel->delete($id);
---
DELETE FROM `books`
WHERE `id` IN ('5')

            return redirect()->to('/books/create')->withInput();
        }
        $slug = url_title($this->request->getVar('judul'), '-', true);
        $this->booksModel->save([
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'sampul' => $this->request->getVar('sampul')
        ]);
---
UPDATE `books` SET `judul` = 'malioboro at midnight', `slug` = 'malioboro-at-midnight', `penulis` = 'skysphire', `penerbit` = 'gramedia', `sampul` = 'malioboro.JPEG', `updated_at` = '2024-05-24 00:04:05'
WHERE `books`.`id` IN ('1')
INSERT INTO `books` (`judul`, `slug`, `penulis`, `penerbit`, `sampul`, `created_at`, `updated_at`) VALUES ('bulan', 'bulan', 'tereliye', 'gramedia', 'ab', '2024-05-17 07:30:18', '2024-05-17 07:30:18')